Canuto371/TE2003B_501_Practices/Practicas/MKL25Z4_Practica5.c
#include <MKL25Z4.h>

/* LCD 4 bit */
#define RS 0x04
#define RW 0x10
#define EN 0x20

#define MENU_RESET_TIME 10000
#define FAN_NORMAL_DURATION 1000  // 10 segundos
#define FAN_ALARM_DURATION 10000  // 2 minutos=120000
//#define TEMP_THRESHOLD 1
#define FAN_INTERVAL 100

volatile uint32_t lastKeyPressTime = 0;
volatile uint32_t lastFanActivation = 0;
volatile float desiredTemperature = 0.0;
volatile uint8_t inputPosition = 0;
volatile uint8_t temperatureInput[2] = {0};
volatile uint8_t systemState = 0;  // 0=normal, 1=alarm
volatile uint8_t idleMode = 0;
volatile uint8_t fanActive = 0;
volatile uint32_t fanStartTime = 0;

void delayMs(int n);
void delayUs(int n);
void keypad_init(void);
char keypad_getkey(void);
void LCD_command(unsigned char command);
void LCD_data(unsigned char data);
void LCD_init(void);
void send_nibble(unsigned char nibble);
char convert_key(unsigned char key);
void LED_init(void);
void show_main_menu();
void LCD_print(char *str);
void process_temperature_input(char key);
void update_temperature_display();
void clear_line(uint8_t line);
void ADC_init(void);
void update_actual_temperature_display();
void check_temperature_comparison();
void start_fan(uint32_t duration);
void stop_fan(void);
void check_fan_timer(void);
uint16_t read_potentiometer(void);

int main(void)
{
    SIM->SCGC6 |= 0x01000000;
    SIM->SOPT2 |= 0x01000000;
    TPM0->SC = 0;
    TPM0->SC = 0x02;
    TPM0->MOD = 0x2000;
    TPM0->SC |= 0x80;
    TPM0->CNT = 0;
    TPM0->SC |= 0x08;

    keypad_init();
    LCD_init();
    LED_init();
    ADC_init();

    show_main_menu();

    while (1) {
        unsigned char key = keypad_getkey();
        char keyChar = convert_key(key);

        if (key) {
			lastKeyPressTime = TPM0->CNT;
			if (keyChar == '*') {
				// Reset del sistema
				temperatureInput[0] = 0;
				temperatureInput[1] = 0;
				inputPosition = 0;
				desiredTemperature = 0.0;
				systemState = 0;
				idleMode = 0;
				stop_fan();
				show_main_menu();
			}
			else if (keyChar >= '0' && keyChar <= '9') {
				process_temperature_input(keyChar);
			}
			else if (keyChar == 'A') {
				idleMode = 1;
				stop_fan();
				LCD_command(0xC0);
				LCD_print("IDLE MODE ON ");
			}
			else if (keyChar == 'B') {
				idleMode = 0;
				LCD_command(0xC0);
				LCD_print("IDLE MODE OFF");
				lastFanActivation = TPM0->CNT;
			}
			else if (keyChar == '#') {
				desiredTemperature = temperatureInput[0] * 10 + temperatureInput[1];
				if(desiredTemperature <= 30 && desiredTemperature >= 0) {
					LCD_command(1);
					LCD_command(0x80);
					LCD_print("Set Temp:");
					LCD_data(temperatureInput[0] + '0');
					LCD_data(temperatureInput[1] + '0');
					LCD_print(" C");

					while(1) {
						if(!idleMode) {
							update_actual_temperature_display();
							check_temperature_comparison();
							check_fan_timer();
						}

						unsigned char newKey = keypad_getkey();
						if(newKey) {
							char newKeyChar = convert_key(newKey);
							if(newKeyChar == '*') {
								show_main_menu();
								break;
							}
							else if(newKeyChar == 'A') {
								idleMode = 1;
								stop_fan();
								LCD_command(0xC0);
								LCD_print("IDLE MODE ON ");
							}
							else if(newKeyChar == 'B') {
								idleMode = 0;
								LCD_command(0xC0);
								LCD_print("IDLE MODE OFF");
							    delayMs(1000);
								lastFanActivation = TPM0->CNT;
							}
					   }
				   }
                }
            }
        }
        if (!idleMode) {
			if (systemState == 1) { // Modo alarma
				if (!fanActive) {
					start_fan(FAN_ALARM_DURATION);
				}
			}
			else { // Modo normal
				if (!fanActive && (TPM0->CNT - lastFanActivation) >= FAN_INTERVAL) {
					start_fan(FAN_NORMAL_DURATION);
					lastFanActivation = TPM0->CNT;
				}
			}
		}

        if (fanActive && (TPM0->CNT - fanStartTime) >= (systemState == 1 ? FAN_ALARM_DURATION : FAN_NORMAL_DURATION)) {
			stop_fan();
			if (systemState == 1) systemState = 0; // Salir del modo alarma
		}
        if ((TPM0->CNT - lastKeyPressTime) > MENU_RESET_TIME) {
            show_main_menu();
            lastKeyPressTime = TPM0->CNT;
        }
    }
}

void start_fan(uint32_t duration) {
    if (idleMode) return;

    PTB->PCOR = 0x40000; // Encender LED (simular ventilador)
    fanActive = 1;
    fanStartTime = TPM0->CNT;
}

void stop_fan(void) {
    PTB->PSOR = 0x40000; // Apagar LED (detener ventilador)
    fanActive = 0;
}

void check_fan_timer(void) {
    if (fanActive) {
        uint32_t currentDuration = systemState == 1 ? FAN_ALARM_DURATION : FAN_NORMAL_DURATION;
        if ((TPM0->CNT - fanStartTime) >= currentDuration) {
            stop_fan();
            if (systemState == 1) systemState = 0; // Salir del modo alarma
        }
    }
}

void process_temperature_input(char key) {
    if (inputPosition < 2) {
        temperatureInput[inputPosition] = key - '0';
        inputPosition++;
        update_temperature_display();
    }
}

void update_temperature_display() {
    LCD_command(0xC0);
    LCD_print("Temp: ");

    if (inputPosition > 0) {
        LCD_data(temperatureInput[0] + '0');
        delayMs(100);
    } else {
        LCD_data('0');
    }

    if (inputPosition > 1) {
        LCD_data(temperatureInput[1] + '0');
        delayMs(100);
    } else {
        LCD_data('0');
    }

    LCD_print(" C    ");
}

void clear_line(uint8_t line) {
    LCD_command(line == 0 ? 0x80 : 0xC0);
    for (uint8_t i = 0; i < 16; i++) {
        LCD_data(' ');
    }
}

void show_main_menu() {
    LCD_command(1);
    delayMs(10);

    LCD_command(0x80);
    LCD_print("Set temperature");
    update_temperature_display();
}

void check_temperature_comparison() {
    float currentTemp = (read_potentiometer() / 1023.0) * 50.0;
    float setTemp = temperatureInput[0] * 10 + temperatureInput[1];

    LCD_command(0xC0);
    LCD_print("Actual:");

    // Mostrar temperatura actual (siempre 2 dígitos)
    int tempInt = (int)(currentTemp + 0.5);
    if(tempInt < 10) {
        LCD_data('0');
        LCD_data(tempInt + '0');
    } else {
        LCD_data((tempInt/10) + '0');
        LCD_data((tempInt%10) + '0');
    }
    LCD_print(" C      ");

    // Control del ventilador
    if (currentTemp > setTemp) {
		systemState = 1; // Entrar en modo alarma
	}
}

void update_actual_temperature_display() {
    uint16_t adcValue = read_potentiometer();
    #define ADC_MIN 0    // Valor ADC a 0°C
    #define ADC_MAX 1023 // Valor ADC a 50°C

    float currentTemp = ((adcValue - ADC_MIN) / (float)(ADC_MAX - ADC_MIN)) * 50.0;

    // Limitar valores entre 0 y 50
    if(currentTemp < 0) currentTemp = 0;
    if(currentTemp > 50) currentTemp = 50;

    LCD_command(0xC0);  // Ir al inicio de la segunda línea
    LCD_print("Actual:    ");  // Espacios para limpiar dígitos anteriores

    // Mostrar temperatura con 2 dígitos siempre
    int tempInt = (int)(currentTemp + 0.5); // Redondeo al entero más cercano

    LCD_command(0xC7);  // Posicionar cursor después de "Actual:"

    // Mostrar siempre dos dígitos para temperaturas de 0-9
    if(tempInt < 10) {
        LCD_data('0');
        LCD_data(tempInt + '0');
    }
    // Mostrar dos dígitos para temperaturas de 10-50
    else {
        LCD_data((tempInt/10) + '0');
        LCD_data((tempInt%10) + '0');
    }

    LCD_print(" C    ");
}

void ADC_init(void) {
    // Enable clock to ADC0 and PORT A
    SIM->SCGC6 |= 0x8000000;  // ADC0 clock
    SIM->SCGC5 |= 0x200;      // PORT A clock

    // Configure ADC0
    ADC0->CFG1 = 0x40;        // 10-bit mode, bus clock/2
    ADC0->SC2 = 0;            // Software trigger

    // Configure PTB0 (ADC0_SE8) as analog input
    PORTA->PCR[0] = 0;        // Disable digital pin function
}

uint16_t read_potentiometer(void) {
    // Select ADC channel 8 (PTA0) con promedio de 4 muestras
    uint32_t sum = 0;
    for(int i=0; i<4; i++) {
        ADC0->SC1[0] = 0x08;  // Channel 8
        while(!(ADC0->SC1[0] & 0x80)) {} // Wait for conversion
        sum += ADC0->R[0];
        delayMs(1);  // Pequeño delay entre muestras
    }
    return sum;  // Retorna el valor promedio
}

void LED_init(void)
{
    SIM->SCGC5 |= 0x400; /* enable clock to Port B */
    SIM->SCGC5 |= 0x1000; /* enable clock to Port D */
    PORTB->PCR[18] = 0x100; /* make PTB18 pin as GPIO */
    PTB->PDDR |= 0x40000; /* make PTB18 as output pin */
    PTB->PSOR |= 0x40000; /* turn off red LED */
    PORTB->PCR[19] = 0x100; /* make PTB19 pin as GPIO */
    PTB->PDDR |= 0x80000; /* make PTB19 as output pin */
    PTB->PSOR |= 0x80000; /* turn off green LED */
    PORTD->PCR[1] = 0x100; /* make PTD1 pin as GPIO */
    PTD->PDDR |= 0x02; /* make PTD1 as output pin */
    PTD->PSOR |= 0x02; /* turn off blue LED */
}

void LCD_print(char *str) {
    while (*str) LCD_data(*str++);
}

char convert_key(unsigned char key)
{
    switch (key)
    {
    case 1: return '1';
    case 2: return '2';
    case 3: return '3';
    case 4: return 'A';
    case 5: return '4';
    case 6: return '5';
    case 7: return '6';
    case 8: return 'B';
    case 9: return '7';
    case 10: return '8';
    case 11: return '9';
    case 12: return 'C';
    case 13: return '*';
    case 14: return '0';
    case 15: return '#';
    case 16: return 'D';
    default: return ' ';
    }
}

void keypad_init(void)
{
    SIM->SCGC5 |= 0x0800;

    for (int i = 0; i < 8; i++)
        PORTC->PCR[i] = 0x103;

    PTC->PDDR |= 0x0F;
    PTC->PSOR = 0x0F;
}

char keypad_getkey(void)
{
    int row, col;
    const char row_select[] = {0x01, 0x02, 0x04, 0x08};

    PTC->PSOR = 0xFF;
    delayUs(2);
    col = PTC->PDIR & 0xF0;
    if (col == 0x0F) return 0;

    for (row = 0; row < 4; row++)
    {
        PTC->PSOR = 0xFF;
        PTC->PCOR = row_select[row];
        delayUs(2);
        col = PTC->PDIR & 0xF0;
        if (col != 0xF0) break;
    }

    PTC->PSOR = 0xFF;
    if (row == 4) return 0;

    if (col == 0xE0) return row * 4 + 1;
    if (col == 0xD0) return row * 4 + 2;
    if (col == 0xB0) return row * 4 + 3;
    if (col == 0x70) return row * 4 + 4;

    return 0;
}

void LCD_init(void)
{
    SIM->SCGC5 |= 0x1000;
    for (int i = 4; i <= 7; i++)
        PORTD->PCR[i] = 0x100;
    PTD->PDDR |= 0xF0;

    SIM->SCGC5 |= 0x0200;
    PORTA->PCR[2] = 0x100;
    PORTA->PCR[4] = 0x100;
    PORTA->PCR[5] = 0x100;
    PTA->PDDR |= 0x34;

    delayMs(30);

    PTA->PCOR = RS | RW;
    send_nibble(0x03);
    delayMs(10);
    send_nibble(0x03);
    delayMs(1);
    send_nibble(0x03);
    send_nibble(0x02);

    LCD_command(0x28);
    LCD_command(0x06);
    LCD_command(0x01);
    LCD_command(0x0F);
}

void LCD_command(unsigned char command)
{
    PTA->PCOR = RS | RW;
    send_nibble(command >> 4);
    send_nibble(command & 0x0F);
    if (command < 4)
        delayMs(4);
    else
        delayMs(1);
}

void LCD_data(unsigned char data)
{
    PTA->PSOR = RS;
    PTA->PCOR = RW;
    send_nibble(data >> 4);
    send_nibble(data & 0x0F);
    delayMs(1);
}

void send_nibble(unsigned char nibble)
{
    PTD->PDOR &= ~0xF0;
    PTD->PDOR |= (nibble & 0x0F) << 4;
    PTA->PSOR = EN;
    delayMs(1);
    PTA->PCOR = EN;
}

void delayMs(int n)
{
    for (int i = 0; i < n; i++)
    {
        while ((TPM0->SC & 0x80) == 0) {}
        TPM0->SC |= 0x80;
    }
}

void delayUs(int n)
{
    while ((TPM0->SC & 0x80) == 0) {}
    TPM0->SC |= 0x80;
}
